In [4]:
import pandas as pd

In [5]:
df = pd.DataFrame([['Anna', 23, 3],
             ['Sam', 36, 12],
             ['Bill', 33, 10],
             ['Monica', 25, 7],
             ['Lisa', 27, 7],
             ['Peter', 32, None]])

In [7]:
df

        0   1     2
0    Anna  23   3.0
1     Sam  36  12.0
2    Bill  33  10.0
3  Monica  25   7.0
4    Lisa  27   7.0
5   Peter  32   NaN

In [8]:
type(df)

pandas.core.frame.DataFrame

In [9]:
df[0]

0      Anna
1       Sam
2      Bill
3    Monica
4      Lisa
5     Peter
Name: 0, dtype: object

In [10]:
type(df[0])

pandas.core.series.Series

In [11]:
df.columns = ['name', 'age', 'expr']

In [12]:
df

     name  age  expr
0    Anna   23   3.0
1     Sam   36  12.0
2    Bill   33  10.0
3  Monica   25   7.0
4    Lisa   27   7.0
5   Peter   32   NaN

In [13]:
df.iloc[1, 2]

12.0

In [14]:
df.iloc[1:3, 1]

1    36
2    33
Name: age, dtype: int64

In [15]:
df.iloc[:, 0]

0      Anna
1       Sam
2      Bill
3    Monica
4      Lisa
5     Peter
Name: name, dtype: object

In [16]:
df.iloc[1:3, :]

   name  age  expr
1   Sam   36  12.0
2  Bill   33  10.0

In [19]:
df[0]

KeyError: 0

In [20]:
df[0:2]

   name  age  expr
0  Anna   23   3.0
1   Sam   36  12.0

In [21]:
df['name']

0      Anna
1       Sam
2      Bill
3    Monica
4      Lisa
5     Peter
Name: name, dtype: object

In [22]:
df[['name', 'expr']]

     name  expr
0    Anna   3.0
1     Sam  12.0
2    Bill  10.0
3  Monica   7.0
4    Lisa   7.0
5   Peter   NaN

In [23]:
df.index = df['name']
df

          name  age  expr
name
Anna      Anna   23   3.0
Sam        Sam   36  12.0
Bill      Bill   33  10.0
Monica  Monica   25   7.0
Lisa      Lisa   27   7.0
Peter    Peter   32   NaN

In [24]:
df.loc['Bill', 'age']

33

In [25]:
df.loc['Sam':'Lisa', 'expr']

name
Sam       12.0
Bill      10.0
Monica     7.0
Lisa       7.0
Name: expr, dtype: float64

In [26]:
df.loc['Sam':'Lisa',['age', 'expr']]

        age  expr
name
Sam      36  12.0
Bill     33  10.0
Monica   25   7.0
Lisa     27   7.0